trade_exp/src/Documents/РейсОтПоставщика/РейсОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РейсОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6192808a-b721-4de3-b780-6e7774c15660">
    <name>ДатаПрибытияНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2560f69a-852a-4432-a6b7-10f619375949">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8aea8d4d-49ab-4603-a033-8198176aedbc">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c881cda6-9885-4140-a866-ce368a8dbe45">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8b685d4-516e-4bef-a5c2-603ab57f9b57">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0ddded1-7e7f-49ae-803d-8802383a362a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b623269-6e37-4b95-98ee-266b68b43837">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b56b04e8-b732-4c46-a53c-a2198118ebb7">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="209d975d-4310-42b6-971f-978e98a9745f">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6620929a-a274-4407-9742-e5f9a4823c7b">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73460591-5ca1-4efb-8d2a-b493c31e8286">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ad834a54-5628-434f-9e2f-12d4b691e5d6">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1dc74592-a5fe-446f-8bc1-f667a6541130">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="24d0f865-8755-43f7-b433-eb4f26c19c07">
    <name>СчетНаОплатуПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="163d3cfc-2c30-4f0c-8ce3-b06233a6696b">
    <name>ДатаПодачиНаОплату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6de08a23-5870-407d-b993-bdda3659ea54">
    <name>УПДАктОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b2409f2e-9fb9-448b-9415-d6e1536fd98b">
    <name>ФактическаяСтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ec417d54-2790-4cd3-9254-0ea9a45dec34">
    <name>НачалоВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f94659dd-8dc9-42fc-aee6-7b49a000ef74">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e276869-726d-45c8-85db-39c41bb3fb24">
    <name>ЗаложеноВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f639e45d-b307-4c2c-8890-fc369b2f01cf">
    <name>ЗаложеноВСтоимостьБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08cdfe8f-7077-4feb-9125-ee010c8832c9">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c50c39f1-1eae-45f8-8af4-df282961236d">
    <name>ПротяженностьРейса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c273b851-cfb6-4e19-b450-965896d4e680">
    <name>СтоимостьТранспортнойРаботыПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e90b9be2-980f-447c-b0a4-3dcefb5c2554">
    <name>СтоимостьТранспортнойРаботыПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e9a071aa-8475-4553-8306-a926414a8f11">
    <name>СостояниеОплатыШапка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="db7fec46-c355-4e4c-834b-1a78e72004ab">
    <name>РасчетДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a2e3f808-9f58-492e-9d38-44c0a46b76be">
      <name>ЗаказНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="424af99f-bf5f-4c1b-b109-ca41584d4b5f">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89653eca-e88e-4481-8b76-4a411ddfb9e9">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="588cacee-f62f-4f95-8a7d-06bb4cee3139">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="995b91fa-7e9f-4438-a3f0-ec13a55906d6">
      <name>РаспределенныеДеньгиНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c88530ea-a3b6-4a16-a1df-e1c59b97cd37">
      <name>СтоимостьТовара</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1586f226-4574-4c20-81e9-b94f5fd931fe">
      <name>НомерДокументаОснования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>12</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5a0dc294-e120-49b0-9fb8-cf56243373dd">
      <name>ДоверенностьНаСумму</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be88e2f0-6a02-4a1d-a78c-00a0fa139df9">
      <name>РасчетнаяРекомендованнаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6ed24d8c-4e52-46b4-8fe6-9cb731c4083b">
      <name>ЗаложеноВСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4ddf08a6-b577-4374-b782-c867c06979a6">
      <name>ЗаложеноВСтоимостьБезНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="86a6ba0d-e6c4-41be-8fb3-f8f191db5b98">
      <name>СостояниеОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6c9154dc-03f2-4ec2-bcb1-ea8bae214e4c">
      <name>НаличиеАкта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cd0b0061-cd53-436a-90f7-18fb2a4261a2">
    <name>ГруппаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c560de4b-7d9d-4f46-82a7-ee306a75ceda">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae853f65-af3c-468e-b27e-033d9f1f6662">
      <name>Норматив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21c5b145-83dd-4a1e-9f07-265508d78f08">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="49e1cb24-3e6d-4d9b-b4cb-c56dc62c3774">
      <name>ПримечаниеКПоставке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cfa0d9fc-d24d-46d4-a440-130ed16c8eba">
      <name>ДатаРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="179a339d-ef0a-4bbc-989e-09dddf274afd">
      <name>ВремяПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1f6a7962-d1a4-42a8-87a2-4696ecfb2b94">
      <name>ПродолжительностьРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4a30dc3-d74e-4d5a-a455-d8cba82618d0">
      <name>СогласованоСоСкладом</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be396fac-1079-4c47-abd1-ec7f2158b5a5">
      <name>ОбъемПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="269aa6a1-110a-4164-93ab-6cf713d61d50">
      <name>ВесПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cd005857-e2d5-4b9e-b98a-f98bc4c2c670">
      <name>ФактическоеВремяПрибытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="88dd1342-0ced-4f48-a388-bbb4893d7fc1">
      <name>НачалоПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae3f0ad3-64cc-44fb-98b5-199a12f9c2a0">
      <name>ОкончаниеПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2f44c993-6d29-4fd6-8f50-856c8c22fa2e">
      <name>Эстакада</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/РейсОтПоставщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Документы.РейсОтПоставщика.ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//Поставки на склад {	
		Если ЭтоНовый() ИЛИ Ссылка.ДатаПрибытияНаСклад<>ДатаПрибытияНаСклад ИЛИ Ссылка.РасчетДоставки.Количество() <> РасчетДоставки.Количество() Тогда
			//получим текущие данные заказов из ТЧ. Изменим дату разгрузки и время поступления, при прочих равных условиях
			ДатыВПоставкахИзменены = Ложь;
			ИзменитьДанныеСеткиПоставокПоРейсу(ДатыВПоставкахИзменены);
			Если ДатыВПоставкахИзменены Тогда
				Сообщить("Для заказов на вкладке документов клиентов необходимо установить новое время прибытия для текущей даты", СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;
		//} Поставки на склад
		
		Документы.РейсОтПоставщика.РассчитатьСтроки(ЭтотОбъект);
		
		Вес= РасчетДоставки.Итог("Вес");
		Объем= РасчетДоставки.Итог("Объем");
		
		//Транзит
		Если ЭтотОбъект.ТранзитФизЛицо Тогда
			Если ЭтотОбъект.Статус = Перечисления.СтатусыРейсовНаПоставку.Доставлен И ЭтотОбъект.Статус <> Ссылка.Статус Тогда
				//Документы.РейсОтПоставщика.ЗаменитьУслугуДоставки(ЭтотОбъект, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ИзменитьДанныеСеткиПоставокПоРейсу(Ложь, Истина);
	КонецЕсли;
	
	ДатаЗапускаАвтоматическогоРаспределения = Документы.РейсОтПоставщика.ПолучитьНастройкиОбработкиРаспределения();
	Если ЭтоНовый() И ДатаЗапускаАвтоматическогоРаспределения <> Дата(1, 1, 1) И ЭтотОбъект.Дата >= ДатаЗапускаАвтоматическогоРаспределения Тогда
		СостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.НеГотовКОплате;
	КонецЕсли;
	//ЕстьНакладныеЭТрН(Отказ);
	
КонецПроцедуры

Процедура ЕстьНакладныеЭТрН(Отказ)
	
	Если НЕ Отказ И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =	
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Результат
			|ИЗ
			|	Документ.Saby_ТранспортнаяНакладная КАК Накладная
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
			|		ПО Накладная.ДокументОснование_Идентификатор = УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Рейс.Ссылка)
			|ГДЕ
			|	Рейс.Ссылка = &Рейс
			|	И НЕ Накладная.ПометкаУдаления";

		Запрос.УстановитьПараметр("Рейс", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По рейсу есть накладные!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьДанныеСеткиПоставокПоРейсу(ДатыВПоставкахИзменены, ЭтоУдаление=Ложь)
	УсловиеЗаписи = "";
	ИзменяемыеПараметры = Неопределено;
	Если ЭтоУдаление Тогда
		УсловиеЗаписи = "Удаление";
	Иначе
		УсловиеЗаписи = "РейсИзменениеПлана";
		ИзменяемыеПараметры = Новый Структура;
		ИзменяемыеПараметры.Вставить("ДатаВремяРазгрузкиПлан", ДатаПрибытияНаСклад);
	КонецЕсли;
	
	Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(РасчетДоставки.Выгрузить().ВыгрузитьКолонку("ДокументОснование"), УсловиеЗаписи, ИзменяемыеПараметры);
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверим нет ли заказов на доставку ещё в каких то рейсах
	Документы.РейсОтПоставщика.КонтрольОстатков(ЭтотОбъект, Отказ);
	
	Если Не Отказ Тогда
		Движения.ЗаказыКДоставкеОтПоставщика.Записывать = Истина;
		Движения.ЗатратыПоДоставкеОтПоставщика.Записывать = Истина;
		
		Для Каждого ТекСтрока Из РасчетДоставки Цикл
			//ЗаказыКДоставке
			Движение = Движения.ЗаказыКДоставкеОтПоставщика.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗаказНаДоставку = ТекСтрока.ЗаказНаДоставку;
			Движение.Документ = ТекСтрока.ДокументОснование;
			Движение.Количество = 1;
			
			//ЗатратыПоДоставкеОтПоставщика
			Если Дата >= Документы.РейсОтПоставщика.ДатаСтартаАктовПоРегистру() Тогда
				мДокументов= Новый Массив;
				Если ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					мДокументов= Документы.РейсОтПоставщика.ПолучитьДокументыПоЗаказу(ТекСтрока.ДокументОснование);
					Если мДокументов.Количество() = 0 Тогда
						мДокументов.Добавить(ТекСтрока.ДокументОснование);
					КонецЕсли;
				ИначеЕсли ТипЗнч(ТекСтрока.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
					мДокументов.Добавить(ТекСтрока.ДокументОснование);
				КонецЕсли;
				
				СуммаПоступлений= 0;
				Для Каждого ДокументОснование Из мДокументов Цикл
					СуммаПоступлений= СуммаПоступлений+ДокументОснование.СуммаДокумента;
				КонецЦикла;

				СуммаРаспределили= 0;
				Для Каждого ДокументОснование Из мДокументов Цикл
					Движение = Движения.ЗатратыПоДоставкеОтПоставщика.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Перевозчик = Перевозчик;
					Движение.Документ = ДокументОснование;
					Движение.ЗаказНаДоставку= ТекСтрока.ЗаказНаДоставку;
					Движение.ДокументОснование= ТекСтрока.ДокументОснование;
					
					Коэффициент= ТекСтрока.РаспределенныеДеньгиНаДоставку/СуммаПоступлений;
					
					Движение.Сумма = Коэффициент*ДокументОснование.СуммаДокумента;
					
					СуммаРаспределили= СуммаРаспределили+Движение.Сумма;
				КонецЦикла;
				Движение.Сумма= Движение.Сумма+ТекСтрока.РаспределенныеДеньгиНаДоставку-СуммаРаспределили;
			Иначе
				Движения.ЗатратыПоДоставкеОтПоставщика.Очистить();
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТранзитФизЛицо Тогда
		ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
